#+title: Crystal

[[file:../../../homepage.org][Homepage]] / [[file:../../../notes.org][Notes]] / [[file:../../computer-science.org][Computer Science]] / [[file:../languages.org][Programming Languages]] / Crystal

Ruby with baremetal performance?

#+begin_src crystal
1 + 1
#+end_src

#+RESULTS:
: 2

* Web Frameworks
** Amber
Rails/Phoenix equivalent: [[https://amberframework.org/]]
** Kemal
Sinatra equivalent: [[https://kemalcr.com/]]
** Marten
https://martenframework.com/
